# Create an Employee Table with employee name,employee ID & Salary

In [3]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
 user="root",
  password="password",
)

mycursor = mydb.cursor()
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000002AE2432DD30>

In [4]:
dbse = mydb.cursor()

dbse.execute("CREATE DATABASE Employee_Mangement")

In [5]:
dbse = mydb.cursor()

dbse.execute("SHOW DATABASES")

for entry in dbse:
    print(entry)

('doctors',)
('employee_mangement',)
('information_schema',)
('mydatabase',)
('mydatabase1',)
('mysql',)
('performance_schema',)
('sakila',)
('students_database',)
('sys',)
('world',)

In [6]:
mydb = mysql.connector.connect(
  host="localhost",
 user="root",
  password="password",
  database="employee_mangement"
)
dbse = mydb.cursor()

dbse.execute("CREATE TABLE Employee (emp_id INT , EMP_NAME VARCHAR(255),EMP_SALARY DOUBLE )")

In [8]:
dbse = mydb.cursor()

dbse.execute("SHOW TABLES")

for value in dbse:
  print(value)

('employee',)

In [10]:
dbse = mydb.cursor()

dbse.execute("SHOW COLUMNS FROM employee")

for value in dbse:
    print(value)

('emp_id', b'int', 'YES', '', None, '')
('EMP_NAME', b'varchar(255)', 'YES', '', None, '')
('EMP_SALARY', b'double', 'YES', '', None, '')

In [11]:
dbse = mydb.cursor()

sql = "INSERT INTO employee (emp_id , EMP_NAME , EMP_SALARY) VALUES (%s,%s,%s)"
val = [
    ('1','AJAY','100000'),
    ('2','RAM','200000'),
    ('3','Ganesh','80000'),
    ('4','Satya','30000'),
    ('5','Likith','250000'),
    ('6','Raj','32000'),
    ('7','Gopal','70000'),
    ('8','Asha','500000'),
    ('9','Amurtha','23000'),
    ('10','Keerthi','24000')
       
]

dbse.executemany(sql, val)

mydb.commit()

print(dbse.rowcount, "was inserted.")

10 was inserted.

# Write a query to get the maximum and minimum salary from employees table

In [12]:
mycursor = mydb.cursor()

mycursor.execute("SELECT EMP_NAME,EMP_SALARY FROM employee where EMP_SALARY = (select max(EMP_SALARY) from employee)")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('Asha', 500000.0)

In [13]:
mycursor = mydb.cursor()

mycursor.execute("SELECT EMP_NAME,EMP_SALARY FROM employee where EMP_SALARY = (select min(EMP_SALARY) from employee)")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('Amurtha', 23000.0)

# b. Write a query to get the number of employees working with the company

In [14]:
mycursor = mydb.cursor()

mycursor.execute("SELECT COUNT(*) from employee")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(10,)

# c. Write a query to get the first 3 characters of first name from employees table

In [18]:
mycursor = mydb.cursor()

mycursor.execute("SELECT * from employee WHERE EMP_NAME LIKE('AJA%')")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(1, 'AJAY', 100000.0)